# Day11

In [ ]:
# In this lecture we came to know about the PULL like how we can PULL the files from Github to in our Selected folders.

# Day 11b Pandas in Python

In [ ]:
# Used in data analysis , manuplation its a must library 
# We can use people codes to work on our projects to cover large work in less time and they are Open Source.
# Spinal Cord of Pyton in data science.
# Raw data to filter data to create more value by manipulating the data.
# You have to learn Data Driven Decision Making

### Types of Data Analysis 
                                for example 
1- Descriptive Analysis -----  how many registrations for the course

2- Diagnosti Analysis  ------  how is it beneficial

3- Predictive Analysis  -----  how is it likely to happen (the effect of course on your skills)

4- Prescriptive Analysis ----  Whats next now after learning 

### Keywords used in Pandas

1- Dataframe=Worksheet\
2- Series=Coloumn\
3- Index=Row Headings\
4- Row=Row\
5- Nan=Emptycell

In [ ]:
#pip install pandas

In [1]:
#pip install numpy

Requirement already satisfied: numpy in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (2.1.1)
Note: you may need to restart the kernel to use updated packages.

In [2]:
#pip install pandas

Requirement already satisfied: pandas in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
# Import Libraries

import pandas as pd

In [2]:
import numpy as np

### Object Creation

In [4]:
#Object Creation
a=pd.Series([1,2,3,4,5,6])   # type pd. to find different functions that can be used.
a                            #1- Dataframe=Worksheet 1- Dataframe=Worksheet\
                             #2- Series=Coloumn
                             #3- Index=Row Headings
                             #4- Row=Row
                             #5- Nan=Emptycell

                            # 1,2,3,4,5,6 in output are Series and 0,1,2,3,4,5 in output are Index

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [5]:
# Empty Cell 
b=pd.Series([1,2,np.nan,4,5,6])   # type pd. to find different functions that can be used.
b

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
5    6.0
dtype: float64

### Dates Creation

In [6]:
# Dates Creation
dates= pd.date_range("20130101" , periods=6)  # type pd. to find different functions that can be used
dates                                         #20130101 is date like 2013-01-01
                                              #periods=6 is the no.of dates we want ahead from our given date

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

### DataFrame

In [3]:
#Dates Series Coverting in DataFrame
dates= pd.date_range("20130101" , periods=6)  
dates                                         
df=pd.DataFrame(np.random.randn(6 , 4), index =dates , columns=list("ABCD")) # type pd. to find different functions that can be used
df                                                #6 is the Index and #4 is the series

                   A         B         C         D
2013-01-01  0.409852 -1.467209 -1.323680 -0.494296
2013-01-02  0.831032 -0.163205 -0.104475  1.064337
2013-01-03  0.918335  0.398465 -0.015858  1.232132
2013-01-04 -0.721086 -0.508019  0.432417 -1.197294
2013-01-05  0.850119 -0.247523  0.863726 -0.021982
2013-01-06  1.051151  1.455155  1.582600  0.951442

In [10]:
# Importing a Dataset from a library
import pandas as pd
import numpy as np

# Create the DataFrame
df2 = pd.DataFrame({
    "A": 1.0,  # Float value for column A
    "B": pd.Timestamp("20130102"),  # Timestamp for column B
    "C": pd.Series(1, index=list(range(4)), dtype="float32"),  # Series with float32 dtype for column C
    "D": np.array([3] * 4, dtype="int32"),  # Numpy array with int32 dtype for column D
    "E": pd.Categorical(["test", "train", "test", "train"]),  # Categorical data for column E
    "F": "foo"  # String for column F
})

# Display the DataFrame
print(df2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [13]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [14]:
df.head()

                   A         B         C         D
2013-01-01  0.712635 -1.943059 -0.595322  1.304972
2013-01-02  0.198933  1.550102  0.584361  1.738086
2013-01-03  1.211158  1.351721  0.932524 -0.445800
2013-01-04 -2.308751 -0.167272  1.002043 -0.656456
2013-01-05 -1.013024  0.843545 -0.510651 -0.725381

In [16]:
df.head(2)

                   A         B         C         D
2013-01-01  0.712635 -1.943059 -0.595322  1.304972
2013-01-02  0.198933  1.550102  0.584361  1.738086

In [17]:
df.head(3)

                   A         B         C         D
2013-01-01  0.712635 -1.943059 -0.595322  1.304972
2013-01-02  0.198933  1.550102  0.584361  1.738086
2013-01-03  1.211158  1.351721  0.932524 -0.445800

In [15]:
df.tail()

                   A         B         C         D
2013-01-02  0.198933  1.550102  0.584361  1.738086
2013-01-03  1.211158  1.351721  0.932524 -0.445800
2013-01-04 -2.308751 -0.167272  1.002043 -0.656456
2013-01-05 -1.013024  0.843545 -0.510651 -0.725381
2013-01-06 -0.699869 -0.190328  1.818948 -1.106900

In [19]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

### Dataframe to numpy

In [4]:
#Coverting dataframe into numpy
df

                   A         B         C         D
2013-01-01  0.409852 -1.467209 -1.323680 -0.494296
2013-01-02  0.831032 -0.163205 -0.104475  1.064337
2013-01-03  0.918335  0.398465 -0.015858  1.232132
2013-01-04 -0.721086 -0.508019  0.432417 -1.197294
2013-01-05  0.850119 -0.247523  0.863726 -0.021982
2013-01-06  1.051151  1.455155  1.582600  0.951442

In [21]:
df.to_numpy()        # type pd. to find different functions that can be used

array([[ 0.7126354 , -1.94305865, -0.59532217,  1.30497246],
       [ 0.1989328 ,  1.55010182,  0.58436114,  1.73808586],
       [ 1.21115797,  1.35172069,  0.93252413, -0.44579967],
       [-2.30875083, -0.16727167,  1.00204266, -0.65645635],
       [-1.01302394,  0.84354526, -0.51065124, -0.72538128],
       [-0.69986942, -0.19032801,  1.81894841, -1.10690025]])

### Statistical Analysis

In [22]:
#Mean Median Mode
df.describe()           # type pd. to find different functions that can be used
                        #std standard deviation , 25% 1st quartile upto 75% 3rd quartile

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.316486  0.240785  0.538650  0.018087
std    1.285279  1.298719  0.937875  1.191890
min   -2.308751 -1.943059 -0.595322 -1.106900
25%   -0.934735 -0.184564 -0.236898 -0.708150
50%   -0.250468  0.338137  0.758443 -0.551128
75%    0.584210  1.224677  0.984663  0.867279
max    1.211158  1.550102  1.818948  1.738086

### Transpose Data

In [24]:
#Transpose Data
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

### Sorting

In [27]:
#Sorting
df.sort_index(axis=1 , ascending=True)

                   A         B         C         D
2013-01-01  0.712635 -1.943059 -0.595322  1.304972
2013-01-02  0.198933  1.550102  0.584361  1.738086
2013-01-03  1.211158  1.351721  0.932524 -0.445800
2013-01-04 -2.308751 -0.167272  1.002043 -0.656456
2013-01-05 -1.013024  0.843545 -0.510651 -0.725381
2013-01-06 -0.699869 -0.190328  1.818948 -1.106900

### Sorting According to Values

In [28]:
df.sort_values(by="B")           #DATAFRAME sorted according to the values of Series B aka Cloumn B

                   A         B         C         D
2013-01-01  0.712635 -1.943059 -0.595322  1.304972
2013-01-06 -0.699869 -0.190328  1.818948 -1.106900
2013-01-04 -2.308751 -0.167272  1.002043 -0.656456
2013-01-05 -1.013024  0.843545 -0.510651 -0.725381
2013-01-03  1.211158  1.351721  0.932524 -0.445800
2013-01-02  0.198933  1.550102  0.584361  1.738086

In [30]:
df["A"]

2013-01-01    0.712635
2013-01-02    0.198933
2013-01-03    1.211158
2013-01-04   -2.308751
2013-01-05   -1.013024
2013-01-06   -0.699869
Freq: D, Name: A, dtype: float64

In [31]:
df["B"]

2013-01-01   -1.943059
2013-01-02    1.550102
2013-01-03    1.351721
2013-01-04   -0.167272
2013-01-05    0.843545
2013-01-06   -0.190328
Freq: D, Name: B, dtype: float64

In [5]:
df

                   A         B         C         D
2013-01-01  0.409852 -1.467209 -1.323680 -0.494296
2013-01-02  0.831032 -0.163205 -0.104475  1.064337
2013-01-03  0.918335  0.398465 -0.015858  1.232132
2013-01-04 -0.721086 -0.508019  0.432417 -1.197294
2013-01-05  0.850119 -0.247523  0.863726 -0.021982
2013-01-06  1.051151  1.455155  1.582600  0.951442

### Row wise Filtration

In [35]:

df[0:2]

                   A         B         C         D
2013-01-01  0.712635 -1.943059 -0.595322  1.304972
2013-01-02  0.198933  1.550102  0.584361  1.738086

In [36]:
df[0:1]

                   A         B         C         D
2013-01-01  0.712635 -1.943059 -0.595322  1.304972

In [38]:
df[1:3]

                   A         B         C         D
2013-01-02  0.198933  1.550102  0.584361  1.738086
2013-01-03  1.211158  1.351721  0.932524 -0.445800

In [6]:
df.loc[dates[2]]            #loc is used to do specific index framing

A    0.918335
B    0.398465
C   -0.015858
D    1.232132
Name: 2013-01-03 00:00:00, dtype: float64

In [7]:
df.loc[dates[0]]

A    0.409852
B   -1.467209
C   -1.323680
D   -0.494296
Name: 2013-01-01 00:00:00, dtype: float64

### Multiple Axis Labels

In [8]:
df.loc[:,["A" , "B"]]

                   A         B
2013-01-01  0.409852 -1.467209
2013-01-02  0.831032 -0.163205
2013-01-03  0.918335  0.398465
2013-01-04 -0.721086 -0.508019
2013-01-05  0.850119 -0.247523
2013-01-06  1.051151  1.455155

In [9]:
df.loc[:,["C" , "D"]]

                   C         D
2013-01-01 -1.323680 -0.494296
2013-01-02 -0.104475  1.064337
2013-01-03 -0.015858  1.232132
2013-01-04  0.432417 -1.197294
2013-01-05  0.863726 -0.021982
2013-01-06  1.582600  0.951442

### Extracting Single Data

In [10]:
df

                   A         B         C         D
2013-01-01  0.409852 -1.467209 -1.323680 -0.494296
2013-01-02  0.831032 -0.163205 -0.104475  1.064337
2013-01-03  0.918335  0.398465 -0.015858  1.232132
2013-01-04 -0.721086 -0.508019  0.432417 -1.197294
2013-01-05  0.850119 -0.247523  0.863726 -0.021982
2013-01-06  1.051151  1.455155  1.582600  0.951442

In [11]:
df.loc["20130104" , ["A", "B", "C", "D"]]

A   -0.721086
B   -0.508019
C    0.432417
D   -1.197294
Name: 2013-01-04 00:00:00, dtype: float64

In [14]:
df.loc["20130101" : "20130104"  , ["A","B", "C", "D"]]

                   A         B         C         D
2013-01-01  0.409852 -1.467209 -1.323680 -0.494296
2013-01-02  0.831032 -0.163205 -0.104475  1.064337
2013-01-03  0.918335  0.398465 -0.015858  1.232132
2013-01-04 -0.721086 -0.508019  0.432417 -1.197294

### At Function

In [15]:
df.at[dates[0], "A"]          #telling the index and getting the series value

np.float64(0.40985245482300425)

### Position

In [17]:
df.iloc[1:4]

                   A         B         C         D
2013-01-02  0.831032 -0.163205 -0.104475  1.064337
2013-01-03  0.918335  0.398465 -0.015858  1.232132
2013-01-04 -0.721086 -0.508019  0.432417 -1.197294

### Booleans Operator

In [18]:
df[df["A"] > 1]

                   A         B       C         D
2013-01-06  1.051151  1.455155  1.5826  0.951442

In [19]:
df[df["A"] <  1]

                   A         B         C         D
2013-01-01  0.409852 -1.467209 -1.323680 -0.494296
2013-01-02  0.831032 -0.163205 -0.104475  1.064337
2013-01-03  0.918335  0.398465 -0.015858  1.232132
2013-01-04 -0.721086 -0.508019  0.432417 -1.197294
2013-01-05  0.850119 -0.247523  0.863726 -0.021982

In [20]:
df[df["B"] > 1]

                   A         B       C         D
2013-01-06  1.051151  1.455155  1.5826  0.951442

In [21]:
df[df["A"] > 0.5]

                   A         B         C         D
2013-01-02  0.831032 -0.163205 -0.104475  1.064337
2013-01-03  0.918335  0.398465 -0.015858  1.232132
2013-01-05  0.850119 -0.247523  0.863726 -0.021982
2013-01-06  1.051151  1.455155  1.582600  0.951442

In [22]:
df[df>0]      # NaN is below zero values in output

                   A         B         C         D
2013-01-01  0.409852       NaN       NaN       NaN
2013-01-02  0.831032       NaN       NaN  1.064337
2013-01-03  0.918335  0.398465       NaN  1.232132
2013-01-04       NaN       NaN  0.432417       NaN
2013-01-05  0.850119       NaN  0.863726       NaN
2013-01-06  1.051151  1.455155  1.582600  0.951442

### Is In Method

In [23]:
df2=df.copy()

In [24]:
df2["Newcolumn"]=["1","2", "3" , "4" , "5" , "6"]
df2

                   A         B         C         D Newcolumn
2013-01-01  0.409852 -1.467209 -1.323680 -0.494296         1
2013-01-02  0.831032 -0.163205 -0.104475  1.064337         2
2013-01-03  0.918335  0.398465 -0.015858  1.232132         3
2013-01-04 -0.721086 -0.508019  0.432417 -1.197294         4
2013-01-05  0.850119 -0.247523  0.863726 -0.021982         5
2013-01-06  1.051151  1.455155  1.582600  0.951442         6

In [ ]:
### Assignment Add ABCD column and creat a new column to put their averages in....s

In [ ]:
### Assignment Add ABCD column and creat a new column to put their averages in....will be putted in other repo